export default {
  '初期化': {
    type: 'func',
    josi: [],
    fn: (...args) => { }
  },
  // @三角関数
  'SIN': {// @ラジアン単位VのSINを求める // @
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  'COS': {// @ラジアン単位VのCOSを求める // @
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  'TAN': {// @ラジアン単位VのTANを求める // @
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  'ARCSIN': {// @ラジアン単位VのARCSINを求める // @
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  'ARCCOS': {// @ラジアン単位VのARCCOSを求める // @
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  'ARCTAN': {// @ラジアン単位VのARCTANを求める // @
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  'RAD2DEG': {// @ラジアンから度に変換 // @
    type: 'func',
    josi: [['を']],
    fn: (...args) => { }
  },
  'DEG2RAD': { // @度からラジアンに変換 // @
    type: 'func',
    josi: [['を']],
    fn: (...args) => { }
  },
  '度変換': { // @ラジアンから度に変換 // @どへんかん
    type: 'func',
    josi: [['を']],
    fn: (...args) => { }
  },
  'ラジアン変換': { // @度からラジアンに変換 // @らじあんへんかん
    type: 'func',
    josi: [['を']],
    fn: (...args) => { }
  },

  // @算術関数
  'SIGN': { // @Vが0なら0を、0超なら1を、0未満なら-1を返す // @
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  '符号': { // @Vが0なら0を、0超なら1を、0未満なら-1を返す // @ふごう
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  'ABS': { // @Vの絶対値を返す // @
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  '絶対値': { // @Vの絶対値を返す // @ぜったいち
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  'EXP': { // @e（自然対数の底）の A 乗の値を返す // @
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  'HYPOT': { // @直角三角形の二辺の長さA,Bから斜辺を求めて返す。 // @
    type: 'func',
    josi: [['と'], ['の']],
    fn: (...args) => { }
  },
  '斜辺': { // @直角三角形の二辺の長さA,Bから斜辺を求めて返す。 // @しゃへん
    type: 'func',
    josi: [['と'], ['の']],
    fn: (...args) => { }
  },
  'LN': { // @実数式 A の自然対数（Ln(A) = 1）を返す // @
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  'LOG': { // @Aの自然対数（底はE）を返す // @
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  'LOGN': { // @指定された底AでBの対数を計算して返す // @
    type: 'func',
    josi: [['で'], ['の']],
    fn: (...args) => { }
  },
  'FRAC': { // @実数Aの小数部分を返す // @
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  '小数部分': { // @実数Aの小数部分を返す // @しょうすうぶぶん
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  '整数部分': { // @実数Aの整数部分を返す // @せいすうぶぶん
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  '乱数': { // @0から(A-1)までの乱数を返す // @らんすう
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  'SQRT': { // @Aの平方根を返す // @
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },
  '平方根': { // @Aの平方根を返す // @
    type: 'func',
    josi: [['の']],
    fn: (...args) => { }
  },

  // @数値切上切捨丸め
  'ROUND': { // @実数型の値Vを丸めてもっとも近い整数値を返す // @
    type: 'func',
    josi: [['を']],
    fn: (...args) => { }
  },
  '四捨五入': { // @実数型の値Vを丸めてもっとも近い整数値を返す // @ししゃごにゅう
    type: 'func',
    josi: [['を', 'の']],
    fn: (...args) => { }
  },
  '小数点切上': { // @整数Aを小数点第B桁で切り上げして返す // @しょうすうてんきりあげ
    type: 'func',
    josi: [['を'], ['で']],
    fn: (...args) => { }
  },
  '小数点切下': { // @整数Aを小数点第B桁で切り下げして返す // @しょうすうてんきりさげ
    type: 'func',
    josi: [['を'], ['で']],
    fn: (...args) => { }
  },
  '小数点四捨五入': { // @実数Aを小数点第B桁で四捨五入して返す // @しょうすうてんししゃごにゅう
    type: 'func',
    josi: [['を'], ['で']],
    fn: (...args) => { }
  },
  'CEIL': { // @数値を正の無限大方向へ切り上げて返す。 // @
    type: 'func',
    josi: [['を']],
    fn: (...args) => { }
  },
  '切上': { // @数値を正の無限大方向へ切り上げて返す。 // @きりあげ
    type: 'func',
    josi: [['を']],
    fn: (...args) => { }
  },
  'FLOOR': { // @数値を負の無限大方向へ切り下げて返す。 // @
    type: 'func',
    josi: [['を']],
    fn: (...args) => { }
  },
  '切捨': { // @数値を負の無限大方向へ切り下げて返す。// @きりすて
    type: 'func',
    josi: [['を']],
    fn: (...args) => { }
  }

}
